[
    {
        "model": "www.blogpost",
        "pk": 1,
        "fields": {
            "title": "HeliumOS v9-Alpha is available for download",
            "summary": "A different approach to HeliumOS: Atomic Desktop",
            "content": "### A different approach\r\n\r\nThis alpha release of HeliumOS is different from the first alpha. KDE Plasma is replaced by GNOME and a Debian base by CentOS Stream. Most importantly, HeliumOS is a proper \"immutable\" distro. HeliumOS now uses bootc to manage updates to the base system delivered using OCI images.\r\n\r\n### Why HeliumOS?\r\n\r\nThose wanting a leading-edge immutable Linux distribution may be better served by the Fedora Atomic Desktops. However each Fedora release has a lifecycle of only 13 months. HeliumOS intends to provide a more stable platform, one measured in years rather than months. CentOS Stream has a 5 year lifecycle, and thus HeliumOS will provide a minimum of 5 years of updates.\r\n\r\n### Considerations\r\n\r\nUsers should be aware of the risks of using a new Linux distribution or Operating System: lack of community, bus factor, etc. bootc is a critical part of HeliumOS, and is currently in a \"Technology Preview\" state. Untill bootc reaches an appropriate level of maturity, HeliumOS will not be considered stable.\r\n\r\n### Miscellaneous\r\n\r\nHeliumOS is seeking contributors; Testers, developers and designers are needed. CentOS Stream 10 is expected to be released within the next year, so it is possible for HeliumOS 10 to be the first stable release, ending HeliumOS 9 as a pre-release.\r\n\r\n### Download\r\n\r\nSee [Pre-Releases](https://www.heliumos.org/releases/pre-release/) to download HeliumOS v9-Alpha",
            "slug": "heliumos-v9-alpha-is-available-for-downlaod",
            "create_date": "2024-06-23",
            "is_published": true
        }
    },
    {
        "model": "www.blogpost",
        "pk": 2,
        "fields": {
            "title": "This Month in HeliumOS: August 2024",
            "summary": "Welcome to the first installment of \"This Month in HeliumOS\", a monthly blog series where we'll be sharing updates and news around HeliumOS.",
            "content": "Welcome to the first installment of \"This Month in HeliumOS\", a monthly blog series where we'll be sharing updates and news around HeliumOS! If you're interested in contributing or sharing your own HeliumOS-related news, please join us in our <a href=\"https://matrix.to/#/#heliumos:matrix.org\" class=\"link\">Matrix space</a>.\r\n\r\n## User Experience\r\n- **GNOME Software update**: GNOME Software has been bumped to the version typically distributed with GNOME 45. This resolves problems caused by using earlier versions of GNOME Software and Flatpak repositories together.\r\n- **GNOME Web replaces Chromium**: Chromium has been replaced by GNOME Web in the system image. This change was made because our users should have a web browser available out of the box and the liberty to use the web browser of their choice. GNOME Web requires less storage space and integrates better with the rest of the GNOME desktop on HeliumOS.\r\n- **Graphical booting with Plymouth**: HeliumOS now uses Plymouth for graphical booting, providing a visually appealing loading screen during boot. If you use disk encryption, you'll be able to type the decryption password into a graphical prompt instead of a text interface.\r\n- **System Images app**: A new System Images app has been added to HeliumOS, allowing you to easily check for updates, perform manual upgrades, and (soon) switch between different operating system variants. System Images is also known as <a href=\"https://codeberg.org/HeliumOS/bootc-gtk\" class=\"link\">bootc-gtk</a>.\r\n\r\n## Development\r\n- **Canary release**: HeliumOS now offers a canary release. This variant is suitable for users interested in access to HeliumOS updates sooner and willing to tolerate a slightly higher risk of instability.\r\n- **Official roadmap**: We're now publishing a roadmap on the HeliumOS website. Checkout our <a href=\"https://www.heliumos.org/roadmap/\" class=\"link\">roadmap</a> to learn more about our plans for the future. Currently, we're working on an \"Edge\" edition of HeliumOS. This edition will have better support for newer hardware by using a more recent version of the Linux kernel.\r\n\r\n## Fixes & Misc\r\n- **New wallpapers**: We've added new wallpapers to HeliumOS. If you like the GNOME 40 default backgrounds, enjoy!\r\n- **Session exit fix**: We fixed a bug that caused a 25-second delay when logging out or otherwise exiting your session. The confirmation prompt now appears immediately.\r\n- **Updated base images**: HeliumOS has been newly rebased on AlmaLinux 9.4's bootc images.\r\n\r\nThat's all for now, more updates next month!",
            "slug": "this-month-in-heliumos-august-2024",
            "create_date": "2024-08-25",
            "is_published": true
        }
    },
    {
        "model": "www.blogpost",
        "pk": 3,
        "fields": {
            "title": "This Month in HeliumOS: September 2024",
            "summary": "Welcome again to This Month in HeliumOS! This time we have a few changes with a focus on hardware and infrastructure.",
            "content": "Welcome again to This Month in HeliumOS! This time we have a few changes with a focus on hardware and infrastructure. If you're interested in contributing or sharing your own HeliumOS-related news, please join us in our <a href=\"https://matrix.to/#/#heliumos:matrix.org\" class=\"link\">Matrix space</a>.\r\n\r\n\r\n## Development\r\n\r\n- **Edge Edition**: HeliumOS Edge Edition is a new variant that brings HeliumOS to newer devices. The kernel/drivers are derived directly from the leading-edge Fedora distribution. The rest of the software is primarily based on CentOS Stream, which tracks ahead of other Enterprise Linux distributions. If your hardware is too recent for the standard edition of HeliumOS, try HeliumOS Edge instead!\r\n\r\n- **Build Infrastructure**: The bootc images that deliver HeliumOS updates are built using Continuous Integration (CI). We have migrated from quay.io to GitHub Actions for CI for more flexible and efficient builds. Unlike before, build logs are now publicly available.\r\n\r\n- **Deployment Infrastructure**: Additionally, HeliumOS bootc images are available from oci.heliumos.org instead of quay.io. Current installations of HeliumOS will continue to update without breaking. Our server at oci.heliumos.org uses `HTTP 307` redirects to deliver images from quay.io despite the different URI. We are currently developing <a href=\"https://codeberg.org/HeliumOS/oci-registry-router\" class=\"link\">OCI Registry Router</a> to further improve our deployment system.\r\n\r\n## Misc\r\n\r\n- **Hardware Compatibility Information**: One major barrier to adoption for many operating systems is a lack of known compatible hardware. Fortunately, some hardware vendors verify hardware for Enterprise Linux distributions. As an Enterprise Linux derivative, HeliumOS is compatible with these devices. See  the <a href=\"/hardware/\" class=\"link\">Hardware Compatibility List</a>.\r\n\r\nThat's all for now, more updates next month!",
            "slug": "this-month-in-heliumos-september-2024",
            "create_date": "2024-09-28",
            "is_published": true
        }
    },
    {
        "model": "www.blogpost",
        "pk": 4,
        "fields": {
            "title": "This Month in HeliumOS: October 2024",
            "summary": "Welcome to October 2024's installment of  This Month in HeliumOS! The changes this month were few and may have gone unnoticed.",
            "content": "Welcome to October 2024's installment of  This Month in HeliumOS! The changes this month were few and may have gone unnoticed.\r\n\r\n## User Experience\r\n\r\n- **Mutable Exceptions**: This change may not affect ordinary users, however it should delight developers and power users. The */opt* and */usr/local* directories are now mutable, allowing system administrators to install software to those locations.\r\n\r\n- **Docker**: Docker Engine, Docker Compose, and the Docker CLI are tools used by many developers for the containerization of software. Although Podman is also installed, the addition of Docker to HeliumOS installations makes some Podman-incompatible use-cases possible. You may wish to follow the Docker <a href=\"https://docs.docker.com/engine/install/linux-postinstall/\" class=\"link\">post-installation steps</a>.\r\n\r\n## Development\r\n\r\n- **Edge Edition**: HeliumOS Edge Edition brings HeliumOS to newer hardware. Previously, the Linux kernel distributed with HeliumOS Edge was repurposed from a Fedora package. Due to various concerns, this has been replaced by the mainline kernel provided by the ELRepo Project. As of this month, HeliumOS Edge Edition is now running Linux 6.11 instead of 6.8. Thank you to boredsquirrel for his feedback!",
            "slug": "this-month-in-heliumos-october-2024",
            "create_date": "2024-11-03",
            "is_published": true
        }
    },
    {
        "model": "www.blogpost",
        "pk": 5,
        "fields": {
            "title": "This Month in HeliumOS: November 2024",
            "summary": "Welcome to This Month in HeliumOS! We have exciting news this month concerning HeliumOS, EL10, and KDE.",
            "content": "Welcome to This Month in HeliumOS! We have exciting news this month concerning HeliumOS, EL10, and KDE. If you're interested in contributing or sharing your own HeliumOS-related news, please join us in our <a href=\"https://matrix.to/#/#heliumos:matrix.org\" class=\"link\">Matrix space</a>.\r\n\r\n## Development\r\n\r\n- **Enterprise Linux 10**:  HeliumOS has begun experimental builds based on Enterprise Linux 10. Our current plans are to use CentOS Stream as a base until EOL, followed by a transition to an AlmaLinux base. As bootc images for CentOS Stream 10 are now available, current HeliumOS 10 builds are based on CentOS Stream 10. Although published to our OCI registry as `oci.heliumos.org/heliumos/bootc:10-canary-edge`, these images should be considered pre-alpha.\r\n\r\n- **KDE Plasma**: As part of the upgrade to Enterprise Linux 10, HeliumOS is migrating from GNOME to KDE Plasma. This decision has been made for multiple reasons:\r\n    - Stability: By default, GNOME is missing basic desktop features such as system tray icons. The third-party extensions that provide this functionality are prone to crashes and inconsistency with the rest of the system. KDE Plasma has first-party support for these features and is more reliable as of KDE Plasma 6.\r\n    - Support: GNOME in HeliumOS depends on upstream support. With Enterprise Linux 10, GNOME is still available, but with reduced support. Migration to KDE Plasma will depend on EPEL's packages, which continue to support KDE Plasma.\r\n\r\n    Packaging of KDE Plasma 6 for EPEL is ongoing, so some important applications such as the Discover store and the Spectacle screenshot tool are currently missing. We plan to release a public alpha of HeliumOS 10 once these issues are resolved soon.\r\n\r\n## Misc\r\n\r\n- **Oci Registry Router**: Oci Registry Router is a project that we previously announced with a goal of creating a \"mirrorlist\" for OCI  image registries. Unfortunately, this is made impossible because of limitations of OCI tooling such as Docker and Podman. Because of this, the repository has been archived and development on Oci Registry Router has ceased.\r\n\r\nThat's all for now, more updates next month!",
            "slug": "this-month-in-heliumos-november-2024",
            "create_date": "2024-11-29",
            "is_published": true
        }
    },
    {
        "model": "www.blogpost",
        "pk": 6,
        "fields": {
            "title": "This Month in HeliumOS: December 2024",
            "summary": "Releasing HeliumOS 10 Alpha with KDE Plasma!",
            "content": "Welcome to this year's final post of This Month in HeliumOS, a monthly blog series where we share updates and news around HeliumOS! . If you're interested in contributing or sharing your own HeliumOS-related news, please join us in our <a href=\"https://matrix.to/#/#heliumos:matrix.org\" class=\"link\">Matrix space</a>.\r\n\r\n## HeliumOS 10\r\n\r\n- **Alpha Release**: We are proud to announce an alpha release of HeliumOS 10! The new version brings major changes, most notably the KDE Plasma desktop and a new base on Enterprise Linux 10.\r\n\r\n- **Future of HeliumOS**: The HeliumOS 10 Alpha is a pre-release, not yet suitable for production use. Going forward we will address user feedback, add more features, and eventually freeze for a beta followed by a stable release.\r\n\r\n\r\n## User Experience\r\n\r\n- **Work in Progress**: The KDE Plasma 6 desktop environment is still in the process of of being packaged for HeliumOS and similar systems.  As such, some components of the desktop environment may be missing. Kudos to the Fedora KDE & EPEL package maintainers for their hard work!\r\n\r\n- **System Images**: During the HeliumOS 9 Alpha, the System Images application (bootc-gtk) was included and receiving updates. The System Images application is being rewritten using the Qt library as bootc-qt, and will be included in a later update of the HeliumOS 10 Alpha.\r\n\r\n## Development\r\n\r\n- **Installation Media**: HeliumOS' installation media is now built using [bootc-image-builder](https://github.com/osbuild/bootc-image-builder). Although the iso file is larger, the initial installation should be quicker and function offline.\r\n\r\n\r\nThank you for reading, and see [Pre-Releases](/releases/pre-release/) to download HeliumOS v10-Alpha!",
            "slug": "this-month-in-heliumos-december-2024",
            "create_date": "2024-12-27",
            "is_published": true
        }
    },
    {
        "model": "www.blogpost",
        "pk": 7,
        "fields": {
            "title": "This Month in HeliumOS: January 2025",
            "summary": "Kicking off 2024 with UX Refinements in HeliumOS 10 Alpha!",
            "content": "Welcome to this year’s first edition of *This Month in HeliumOS*! In this series, we share updates and news about HeliumOS. Join our <a href=\"https://matrix.to/#/#heliumos:matrix.org\" class=\"link\">Matrix space</a> to contribute or discuss these updates.  \r\n\r\n---\r\n\r\n## User Experience  \r\n\r\n- **Distrobox Shortcut in App Launcher**: Users reported difficulty starting Distrobox, a command-line tool for container management. To improve accessibility, we’ve added a desktop shortcut that opens a terminal with `distrobox --help` for guidance.  \r\n\r\n- **HeliumOS 9 Alpha Retirement**: Due to the availability of Enterprise Linux 10 and therefore HeliumOS 10 Alpha, we’ve discontinued builds for HeliumOS 9 Alpha. Users testing alpha releases should migrate to **[HeliumOS 10 Alpha](/releases/pre-release/)**.  \r\n\r\n- **Expanded KDE Applications**: HeliumOS 10 Alpha launched with a small selection of applications from the KDE suite. We’ve since added basic utilities such as [KolourPaint](https://apps.kde.org/kolourpaint/) (Paint Program), [Okular](https://apps.kde.org/okular/) (Document Viewer), and [KCalc](https://apps.kde.org/kcalc/) (Scientific Calculator).\r\n\r\n- **Install Scripts for Developer Tools**: To simplify setup, several scripts now enable one-command installation or removal of a few popular tools. As an example, users wanting Docker and/or a local Kubernetes cluster can install Rancher Desktop with a single command by running` heliumos-rancher_desktop-enable` . This can be just as easily removed by running `heliumos-rancher_desktop-disable`.\r\n\r\n---\r\n\r\n## Fixes  \r\n\r\n- **Boot Screen Update**: The Breeze-style boot screen present in earlier revisions of HeliumOS 10 Alpha lacked a graphical password prompt for disk encryption. Switching to the BGRT boot screen resolved this issue.  \r\n\r\n- **Homebrew Compatibility Fix**: When installed via `heliumos-homebrew-enable`, Homebrew now configures system paths automatically, fixing linker errors when compiling with Homebrew libraries.  \r\n\r\n- **Hibernation/Sleep Fix**: Some devices running HeliumOS were unable to wake from Hibernation. We’ve disabled hibernation in favor of sleep as a possible fix, ensuring reliable sleep/wake functionality. A permanent solution is under investigation.\r\n\r\n---\r\n\r\nThank you for reading! See [Pre-Releases](/releases/pre-release/) to download HeliumOS v10-Alpha. More updates next month!",
            "slug": "this-month-in-heliumos-january-2025",
            "create_date": "2025-02-02",
            "is_published": false
        }
    }
]
